import random2 as rd

min_trade = 1500

def btc_text(moneys):

    btc_trade = rd.randint(997682,  997731) + rd.randint(-414, 127)
    
    return f"""🔸 Вы выбрали криптовалюту.

〽️ Информация о сделке:
┏ Текущая Стоимость актива: {btc_trade}₽
┣ Ваш баланс: {moneys}₽
┣ Размер Позиции: Нет информации
┣ Время Фиксации позиции: Нет информации
┣ Ваш коэффициент: Нет информации
┗ Направление цены: Нет информации

⚠️Памятка:
1. Минимальный размер позиции составляет 1000₽.
2. Помните о рисках - в случае неудачного контракта вы безвозвратно потеряете выбранную сумму.

Пожалуйста, введите размер Позиции:"""


def eth_text(moneys):

    eth_trade = rd.randint(70123, 74185) + rd.randint(-414, 127)
    
    return f"""🔸 Вы выбрали криптовалюту.

〽️ Информация о сделке:
┏ Текущая Стоимость актива: {eth_trade}₽
┣ Ваш баланс: {moneys}₽
┣ Размер Позиции: Нет информации
┣ Время Фиксации позиции: Нет информации
┣ Ваш коэффициент: Нет информации
┗ Направление цены: Нет информации

⚠️Памятка:
1. Минимальный размер позиции составляет 1000₽.
2. Помните о рисках - в случае неудачного контракта вы безвозвратно потеряете выбранную сумму.

Пожалуйста, введите размер Позиции:"""


def lt_text(moneys):

    lt_trade = rd.randint(3012, 3729) + rd.randint(-414, 127)
    
    return f"""🔸 Вы выбрали криптовалюту.

〽️ Информация о сделке:
┏ Текущая Стоимость актива: {lt_trade}₽
┣ Ваш баланс: {moneys}₽
┣ Размер Позиции: Нет информации
┣ Время Фиксации позиции: Нет информации
┣ Ваш коэффициент: Нет информации
┗ Направление цены: Нет информации

⚠️Памятка:
1. Минимальный размер позиции составляет 1000₽.
2. Помните о рисках - в случае неудачного контракта вы безвозвратно потеряете выбранную сумму.

Пожалуйста, введите размер Позиции:"""


def ripple_text(moneys):

    ripple_trade = rd.randint(17,25) + rd.randint(-2, 3)
    
    return f"""🔸 Вы выбрали криптовалюту.

〽️ Информация о сделке:
┏ Текущая Стоимость актива: {ripple_trade}₽
┣ Ваш баланс: {moneys}₽
┣ Размер Позиции: Нет информации
┣ Время Фиксации позиции: Нет информации
┣ Ваш коэффициент: Нет информации
┗ Направление цены: Нет информации

⚠️Памятка:
1. Минимальный размер позиции составляет 1000₽.
2. Помните о рисках - в случае неудачного контракта вы безвозвратно потеряете выбранную сумму.

Пожалуйста, введите размер Позиции:"""


def tron_text(moneys):

    tron_trade = rd.randint(1,4) + rd.randint(-1,2)
    
    return f"""🔸 Вы выбрали криптовалюту.

〽️ Информация о сделке:
┏ Текущая Стоимость актива: {tron_trade}₽
┣ Ваш баланс: {moneys}₽
┣ Размер Позиции: Нет информации
┣ Время Фиксации позиции: Нет информации
┣ Ваш коэффициент: Нет информации
┗ Направление цены: Нет информации

⚠️Памятка:
1. Минимальный размер позиции составляет 1000₽.
2. Помните о рисках - в случае неудачного контракта вы безвозвратно потеряете выбранную сумму.

Пожалуйста, введите размер Позиции:"""


def iota_text(moneys):

    iota_trade = rd.randint(10,15) + rd.randint(-2,3)
    
    return f"""🔸 Вы выбрали криптовалюту.

〽️ Информация о сделке:
┏ Текущая Стоимость актива: {iota_trade}₽
┣ Ваш баланс: {moneys}₽
┣ Размер Позиции: Нет информации
┣ Время Фиксации позиции: Нет информации
┣ Ваш коэффициент: Нет информации
┗ Направление цены: Нет информации

⚠️Памятка:
1. Минимальный размер позиции составляет 1000₽.
2. Помните о рисках - в случае неудачного контракта вы безвозвратно потеряете выбранную сумму.

Пожалуйста, введите размер Позиции:"""


def solana_text(moneys):

    solana_trade = rd.randint(691,712) + rd.randint(-17,29)
    
    return f"""🔸 Вы выбрали криптовалюту.

〽️ Информация о сделке:
┏ Текущая Стоимость актива: {solana_trade}₽
┣ Ваш баланс: {moneys}₽
┣ Размер Позиции: Нет информации
┣ Время Фиксации позиции: Нет информации
┣ Ваш коэффициент: Нет информации
┗ Направление цены: Нет информации

⚠️Памятка:
1. Минимальный размер позиции составляет 1000₽.
2. Помните о рисках - в случае неудачного контракта вы безвозвратно потеряете выбранную сумму.

Пожалуйста, введите размер Позиции:"""


def filecoin_text(moneys):

    filecoin_trade = rd.randint(247,263) + rd.randint(-7,9)
    
    return f"""🔸 Вы выбрали криптовалюту.

〽️ Информация о сделке:
┏ Текущая Стоимость актива: {filecoin_trade}₽
┣ Ваш баланс: {moneys}₽
┣ Размер Позиции: Нет информации
┣ Время Фиксации позиции: Нет информации
┣ Ваш коэффициент: Нет информации
┗ Направление цены: Нет информации

⚠️Памятка:
1. Минимальный размер позиции составляет 1000₽.
2. Помните о рисках - в случае неудачного контракта вы безвозвратно потеряете выбранную сумму.

Пожалуйста, введите размер Позиции:"""